package com.nest_lot.constant;

/**
 * 功能：操作返回状态 作者：wf 日期：2017年11月22日
 */
public enum ResultEnum {
	SUCCESS(1000, "操作成功"), ERROR(1001, "操作失败"), ERR_CATCH(1002, "操作异常"), ERR_NONE(1003, "未知错误"),
	ERR_DAOEXCEPTION(1004, "查询数据库语句有误"), ERR_NETWORK_NULL(1005, "网络异常，请稍后再试"), ERR_LIST_NOPERMIT(1006, "您无权操作"),
	ERR_LIST_NULL(1007, "暂无数据"), ERR_SESSION_NULL(1009, "您的会话已失效，请重新登录"), ERR_NONE_ENTITY(1010, "对象不存在"),
	ERR_1101(1101, "名称不能为空"), ERR_1102(1102, "密码不能为空"), ERR_1103(1103, "验证码不能为空"), ERR_1104(1104, "验证码已过期"),
	ERR_1105(1105, "帐号或密码有误"), ERR_1106(1106, "验证码有误"), ERR_1107(1107, "没有传入主键"),
	ERR_1111(1111, "由于密码输入错误次数大于5次，帐号已经禁止登录"), ERR_1112(1112, "此帐号已禁用"), ERR_1113(1113, "此帐号还未开通管理平台登录"),
	ERR_1114(1114, "该帐号已在其他地方登录，请重新登录"), ERR_1115(1115, "删除失败"), ERR_1116(1116, "存储失败"), ERR_1119(1119, "更新失败"),
	ERR_1124(1124, "请输入数量"), ERR_1125(1125, "库存数量不足"), ERR_1118(1118, "授权失败"), ERR_1120(1120, "部门下存在角色,需先删除角色"),
	ERR_1123(1122, "分类下存在商品,需先下架商品"), ERR_1202(1120, "区域下存在大学,需先删除大学和区域的关联"), ERR_1122(1122, "角色下存在用户,需先删除用户"),
	ERR_1121(1121, "原密码错误"), ERR_1117(1117, "已存在相同名称"), ERR_1201(1201, "电话已存在"), ERR_1204(1201, "该房屋已被管理"),
	ERR_1200(1200, "已存在重复属性"), ERR_1305(1305, "改单已经作废,或改单已退款"), SMS_1300(1300, "SMS_140120832"), // 优惠券模板
	SMS_1302(1302, "SMS_140116048"), // 库存
	// SMS_1303(1305, "SMS_144457045"), //退单
	SMS_1303(1305, "SMS_152541920"), // 退单
	SMS_1304(1304, "SMS_149421918"), // 押金退款失败
	SMS_1306(1306, "SMS_149416986"), // 押金退款成功
	// SMS_1306(1306,"押金已成功退回到您的账户"),//押金退款成功
	SMS_1307(1307, "SMS_149421917"), // 活动发布失败
	SMS_1308(1308, "SMS_149416982"), // 活动发布成功
	SMS_1309(1309, "SMS_149416980"), // 导师认证发布成功
	SMS_1310(1310, "SMS_149418390"), // 导师认证发布失败
	SMS_1311(1311, "SMS_152852585"), // 订单重单退款成功

	ERR_1401(1401, "押金状态异常"), ERR_1402(1402, "押金需审核"), ERR_1303(1303, "推送失败"), // 优惠券模板
	ERR_1304(1304, "操作对象不能为空");
	private int code;
	private String message;

	private ResultEnum(int code, String message) {
		this.code = code;
		this.message = message;
	}

	public int getCode() {
		return code;
	}

	public String getMessage() {
		return message;
	}

	@Override
	public String toString() {
		return String.format("result code [%s] message [%s]", code, message);
	}
}
